controllers/SiteController.php

    public function actionIndex()
    {
        $posts = Posts::find()->all();
---
SELECT * FROM `posts`

    public function actionCreate(){
        $post = new Posts();
        $formData = Yii::$app->request->post();
        if($post->load($formData)){
            if($post->save()){
---
INSERT INTO `posts` (`title`, `description`, `category`) VALUES ('dfd', 'fdfs', 'platform')

    public function actionView($id){
        $post = Posts::findOne($id);
---
SELECT * FROM `posts` WHERE `id`='1'

    public function actionDelete($id){
        $post = Posts::findOne($id) ->delete();
---
DELETE FROM `posts` WHERE `id`=5
SELECT * FROM `posts` WHERE `id`='5'